#### FabricHostReference Enumeration

---

|  |
| --- |
| See Also |

Controls if Single Fabric Sheet should be cut by the Host Cover.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum FabricHostReference ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FabricHostReference ``` |

| Visual C++ |
| --- |
| ``` public enum class FabricHostReference ``` |

# Members

| Member name | Description |
| --- | --- |
| NotCutByCover | The fabric is not cut by the host cover. |
| CutByCover | The fabric is cut by the host cover. |

# See Also

Autodesk.Revit.DB.Structure Namespace